# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [98]:
# import libraries here
import pandas as pd
import numpy as np
from zipfile import ZipFile

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [99]:
# your code here
temp = pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [100]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [101]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [102]:
print("""
There are two types of data: object and float64.
The columns 'City' and 'State' are the ones having object types. The column 'Temperature' has float64 type.
""")

There are two types of data: object and float64.
The columns 'City' and 'State' are the ones having object types. The column 'Temperature' has float64 type.

#### Select the rows where state is New York.

In [103]:
# your code here
temp[temp['State'] == 'New York']

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [104]:
# your code here
f"The average temperature of cities in New York is {temp[temp['State'] == 'New York']['Temperature'].mean():.2f}."

'The average temperature of cities in New York is 10.74.'

#### Which states and cities have a temperature above 15 degrees Celsius?

In [105]:
# your code here
print("The states that have a temperature above 15 degrees Celsius are:")
for i in temp[temp['Temperature'] > 15]['State'].unique():
    print('\t',i)
print('and the cities are:')
for i in temp[temp['Temperature'] > 15]['City'].unique():
    print('\t',i)

The states that have a temperature above 15 degrees Celsius are:
	 New York
	 Connecticut
	 New Jersey
and the cities are:
	 NYC
	 Hartford
	 Treton
	 Newark

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [106]:
# your code here
temp[temp['Temperature'] > 15]['City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [107]:
# your code here
temp[(temp['Temperature'] > 15) & (temp['Temperature'] < 20)]['City']

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [108]:
# your code here
temp.groupby(by= 'State').agg(['mean', 'std'])

            Temperature
                   mean       std
State
Connecticut   15.833333  1.964186
New Jersey    21.111111  1.571348
New York      10.740741  8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [109]:
# your code here
employees = pd.read_csv('Employee.csv')
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [110]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [111]:
print("""
There are two types of data: object and int64.
The columns 'Name', 'Department', 'Education', 'Gender' and 'Title' are the ones having object types. The columns
'Years' and 'Salary' have int64 type.
""")

There are two types of data: object and int64.
The columns 'Name', 'Department', 'Education', 'Gender' and 'Title' are the ones having object types. The columns
'Years' and 'Salary' have int64 type.

#### What's the average salary in this company?

In [112]:
# your code here
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [113]:
# your code here
employees['Salary'].max()

70

#### What's the lowest salary?

In [114]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [115]:
# your code here
employees[employees['Salary'] == employees['Salary'].min()]['Name']

1    Maria
2    David
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [116]:
# your code here
employees[employees['Name'] == 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [117]:
# your code here
employees[employees['Name'] == 'David']['Salary'].values

array([30], dtype=int64)

#### Print all the rows where job title is associate.

In [118]:
# your code here
employees[employees['Title'] == 'associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [119]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [120]:
# Method 2
# your code here
employees.iloc[0:3,:]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [121]:
# your code here
employees[(employees['Title'] == 'associate') & (employees['Salary'] > 55)]['Name']

7    Pedro
Name: Name, dtype: object

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [122]:
# your code here
employees.groupby(by= 'Years').agg('mean')

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [123]:
# your code here
employees.groupby(by= 'Title').agg('mean')['Salary']

Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [124]:
# your code here
np.quantile(a= employees['Salary'].values, q= [.25, .5, .75])

array([35., 55., 60.])

#### Is the mean salary different per gender?

In [125]:
# your code here
f"The average salary for women is {employees.groupby(by= 'Gender').agg('mean')['Salary'].loc['F']} and the average salary \
for men is {employees.groupby(by= 'Gender').agg('mean')['Salary'].loc['M']}. The averages are different."

'The average salary for women is 47.5 and the average salary for men is 50.0. The averages are different.'

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [126]:
# your code here
employees.groupby(by= 'Department').agg(['min', 'mean', 'max'])

           Years               Salary
             min      mean max    min   mean max
Department
HR             2  4.666667   8     30  45.00  70
IT             1  4.500000   8     30  48.75  70
Sales          2  2.500000   3     55  55.00  55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [127]:
# your code here
employees.groupby(by= 'Department')['Salary'].agg(np.ptp)

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [128]:
# your code here
with ZipFile('Orders.zip', 'r') as myzip:
    df = pd.read_csv(myzip.open(myzip.infolist()[0].filename))
    myzip.close()
    
df= df.drop(columns= ('Unnamed: 0'))
df

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [129]:
# your code here
print(df.dtypes)
print('\n')
print(df.describe(include= 'all'))
print('\n')
print(df.info())

InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object


            InvoiceNo StockCode           year          month            day  \
count   397924.000000    397924  397924.000000  397924.000000  397924.000000
unique            NaN      3665            NaN            NaN            NaN
top               NaN    85123A            NaN            NaN            NaN
freq              NaN      2035            NaN            NaN            NaN
mean    560617.126645       NaN    2010.934259       7.612537       3.614555
std      13106.167695       NaN       0.247829       3.416527       1.928274
min     536365.000000       NaN    2010.000000       1.000000       1.000000
25%     549234.000000       NaN    2011.000000       5.000000       2.000000
50%     561893.000000       NaN    2011.000000       8.000000       3.000000
75%     572090.000000       NaN    2011.000000      11.000000       5.000000
max     581587.000000       NaN    2011.000000      12.000000       7.000000

                 hour                         Description       Quantity  \
count   397924.000000                              397924  397924.000000
unique            NaN                                3877            NaN
top               NaN  white hanging heart t-light holder            NaN
freq              NaN                                2028            NaN
mean        12.728247                                 NaN      13.021823
std          2.273535                                 NaN     180.420210
min          6.000000                                 NaN       1.000000
25%         11.000000                                 NaN       2.000000
50%         13.000000                                 NaN       6.000000
75%         14.000000                                 NaN      12.000000
max         20.000000                                 NaN   80995.000000

                InvoiceDate      UnitPrice     CustomerID         Country  \
count                397924  397924.000000  397924.000000          397924
unique                17286            NaN            NaN              37
top     2011-11-14 15:27:00            NaN            NaN  United Kingdom
freq                    542            NaN            NaN          354345
mean                    NaN       3.116174   15294.315171             NaN
std                     NaN      22.096788    1713.169877             NaN
min                     NaN       0.000000   12346.000000             NaN
25%                     NaN       1.250000   13969.000000             NaN
50%                     NaN       1.950000   15159.000000             NaN
75%                     NaN       3.750000   16795.000000             NaN
max                     NaN    8142.750000   18287.000000             NaN

         amount_spent
count   397924.000000
unique            NaN
top               NaN
freq              NaN
mean        22.394749
std        309.055588
min          0.000000
25%          4.680000
50%         11.800000
75%         19.800000
max     168469.600000


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397924 entries, 0 to 397923
Data columns (total 13 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   InvoiceNo     397924 non-null  int64
 1   StockCode     397924 non-null  object
 2   year          397924 non-null  int64
 3   month         397924 non-null  int64
 4   day           397924 non-null  int64
 5   hour          397924 non-null  int64
 6   Description   397924 non-null  object
 7   Quantity      397924 non-null  int64
 8   InvoiceDate   397924 non-null  object
 9   UnitPrice     397924 non-null  float64
 10  CustomerID    397924 non-null  int64
 11  Country       397924 non-null  object
 12  amount_spent  397924 non-null  float64
dtypes: float64(2), int64(7), object(4)
memory usage: 39.5+ MB
None

In [130]:
print("""
There are 4 columns with object type: 'StockCode', 'Description', 'InvoiceDate', 'Country'.

All the others ('InvoiceNo','year', 'month', 'day', 'hour', 'Quantity' and 'CustomerID') have type int64, with exception of
columns 'UnitPrice' and 'amount_spent' which have type float64. 

There are no null values in dataset. 


There are 3665 unique values in column 'StockCode'.
There are 3877 unique values in column 'Description'.
There are 17286 unique values in column 'InvoiceDate'.
There are 37 unique values in column 'Country' and the most common value is 'United Kingdom'.

The column 'Quantity' ranges from 1 to 80995 units with a mean of 13.021823.
The column 'UnitPrice' ranges from 0 to 8142.75 with a mean of 3.116174.
The column 'amount_spent' rabnges from 0 to 168469.6 with a mean of 22.394749.

The columns 'InvoiceNo' and 'CustomerID' have no interesting data for statistical analysis.

The columns 'year', 'month', 'day', 'hour' are related to the time of occurrences.

""")

There are 4 columns with object type: 'StockCode', 'Description', 'InvoiceDate', 'Country'.

All the others ('InvoiceNo','year', 'month', 'day', 'hour', 'Quantity' and 'CustomerID') have type int64, with exception of
columns 'UnitPrice' and 'amount_spent' which have type float64.

There are no null values in dataset.


There are 3665 unique values in column 'StockCode'.
There are 3877 unique values in column 'Description'.
There are 17286 unique values in column 'InvoiceDate'.
There are 37 unique values in column 'Country' and the most common value is 'United Kingdom'.

The column 'Quantity' ranges from 1 to 80995 units with a mean of 13.021823.
The column 'UnitPrice' ranges from 0 to 8142.75 with a mean of 3.116174.
The column 'amount_spent' rabnges from 0 to 168469.6 with a mean of 22.394749.

The columns 'InvoiceNo' and 'CustomerID' have no interesting data for statistical analysis.

The columns 'year', 'month', 'day', 'hour' are related to the time of occurrences.

####  What is the average purchase price?

In [131]:
# your code here
df['UnitPrice'].mean()

3.116174480549152

#### What are the highest and lowest purchase prices?

In [132]:
# your code here
print(df['UnitPrice'].max())
print(df['UnitPrice'].min())

8142.75
0.0

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [133]:
# your code here
df[df['Country'] == 'Spain']['CustomerID'].unique()

array([12557, 17097, 12540, 12551, 12484, 12539, 12510, 12421, 12502,
       12462, 12507, 12541, 12547, 12597, 12545, 12596, 12354, 12417,
       12455, 12450, 12548, 12556, 12550, 12546, 12454, 12448, 12544,
       12538, 12445, 12442], dtype=int64)

#### How many customers do we have in Spain?

In [134]:
# your code here
len(df[df['Country'] == 'Spain']['CustomerID'].unique())

30

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [135]:
# your code here
# Dataframe grouped by customer ID where the quantities are aggregated 
selection = df.groupby(by= 'CustomerID')['Quantity'].agg(['sum'])

# display of all customer ID that have bought more than 50 items
selection.loc[selection.values > 50].index

Int64Index([12346, 12347, 12348, 12349, 12350, 12352, 12354, 12355, 12356,
            12357,
            ...
            18272, 18273, 18274, 18276, 18277, 18278, 18281, 18282, 18283,
            18287],
           dtype='int64', name='CustomerID', length=4091)

#### Select orders from Spain that include more than 50 items.

In [136]:
# your code here
# Dataframe containing all orders from Spain, grouped by Invoice number where the quantities are aggregated 
quantity_per_invoice= df.loc[df['Country'] == 'Spain'].groupby(by= 'InvoiceNo')['Quantity'].agg(['sum'])

# display of all invoice numbers from Spain where the quantities are above 50 
quantity_per_invoice.loc[quantity_per_invoice['sum'] > 50].index

Int64Index([536944, 538095, 538525, 539351, 540469, 540550, 540785, 540801,
            541491, 541980, 542303, 542905, 543055, 543541, 543822, 545585,
            545647, 546755, 546760, 547387, 547703, 547790, 547972, 549682,
            550911, 551398, 551868, 552040, 555095, 555470, 555726, 556241,
            557007, 557297, 557303, 557314, 558871, 559135, 559148, 559173,
            559665, 560607, 561093, 561669, 562273, 563477, 563518, 564201,
            564734, 565519, 566040, 567340, 567653, 567968, 568001, 568179,
            568554, 569998, 571255, 571665, 571851, 572065, 572442, 572886,
            573362, 574301, 574550, 575144, 575514, 575707, 577039, 577125,
            577476, 577523, 577606, 578321, 578339, 579503, 580955, 581193],
           dtype='int64', name='InvoiceNo')

#### Select all free orders.

In [137]:
# your code here
df[df['amount_spent'] == 0]

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
6914,537197,22841,2010,12,7,14,round cake tin vintage green,1,2010-12-05 14:02:00,0.0,12647,Germany,0.0
22539,539263,22580,2010,12,4,14,advent calendar gingham sack,4,2010-12-16 14:36:00,0.0,16560,United Kingdom,0.0
25379,539722,22423,2010,12,2,13,regency cakestand 3 tier,10,2010-12-21 13:45:00,0.0,14911,EIRE,0.0
29080,540372,22090,2011,1,4,16,paper bunting retrospot,24,2011-01-06 16:41:00,0.0,13081,United Kingdom,0.0
29082,540372,22553,2011,1,4,16,plasters in tin skulls,24,2011-01-06 16:41:00,0.0,13081,United Kingdom,0.0
34494,541109,22168,2011,1,4,15,organiser wood antique white,1,2011-01-13 15:10:00,0.0,15107,United Kingdom,0.0
53788,543599,84535B,2011,2,4,13,fairy cakes notebook a6 size,16,2011-02-10 13:08:00,0.0,17560,United Kingdom,0.0
85671,547417,22062,2011,3,3,10,ceramic bowl with love heart design,36,2011-03-23 10:25:00,0.0,13239,United Kingdom,0.0
92875,548318,22055,2011,3,3,12,mini cake stand hanging strawbery,5,2011-03-30 12:45:00,0.0,13113,United Kingdom,0.0
97430,548871,22162,2011,4,1,14,heart garland rustic padded,2,2011-04-04 14:42:00,0.0,14410,United Kingdom,0.0
107192,550188,22636,2011,4,4,18,childs breakfast set circus parade,1,2011-04-14 18:57:00,0.0,12457,Switzerland,0.0
128641,553000,47566,2011,5,4,15,party bunting,4,2011-05-12 15:21:00,0.0,17667,United Kingdom,0.0
137127,554037,22619,2011,5,5,14,set of 6 soldier skittles,80,2011-05-20 14:13:00,0.0,12415,Australia,0.0
194648,561284,22167,2011,7,2,12,oval wall mirror diamante,1,2011-07-26 12:24:00,0.0,16818,United Kingdom,0.0
197173,561669,22960,2011,7,4,17,jam making set with jars,11,2011-07-28 17:09:00,0.0,12507,Spain,0.0
199711,561916,M,2011,8,1,11,manual,1,2011-08-01 11:44:00,0.0,15581,United Kingdom,0.0
208950,562973,23157,2011,8,4,11,set of 6 nativity magnets,240,2011-08-11 11:42:00,0.0,14911,EIRE,0.0
223931,564651,23270,2011,8,5,14,set of 2 ceramic painted hearts,96,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
223932,564651,23268,2011,8,5,14,set of 2 ceramic christmas reindeer,192,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
223933,564651,22955,2011,8,5,14,36 foil star cake cases,144,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
223934,564651,21786,2011,8,5,14,polkadot rain hat,144,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
256263,568158,PADS,2011,9,7,12,pads to match all cushions,1,2011-09-25 12:22:00,0.0,16133,United Kingdom,0.0
259399,568384,M,2011,9,2,9,manual,1,2011-09-27 09:46:00,0.0,12748,United Kingdom,0.0
273926,569716,22778,2011,10,4,8,glass cloche small,2,2011-10-06 08:17:00,0.0,15804,United Kingdom,0.0
286507,571035,M,2011,10,4,12,manual,1,2011-10-13 12:50:00,0.0,12446,RSA,0.0
307092,572893,21208,2011,10,3,14,pastel colour honeycomb fan,5,2011-10-26 14:36:00,0.0,18059,United Kingdom,0.0
319882,574138,23234,2011,11,4,11,biscuit tin vintage christmas,216,2011-11-03 11:26:00,0.0,12415,Australia,0.0
320049,574175,22065,2011,11,4,11,christmas pudding trinket pot,12,2011-11-03 11:47:00,0.0,14110,United Kingdom,0.0
320407,574252,M,2011,11,4,13,manual,1,2011-11-03 13:24:00,0.0,12437,France,0.0
322279,574469,22385,2011,11,5,11,jumbo bag spaceboy design,12,2011-11-04 11:55:00,0.0,12431,Australia,0.0
328385,574879,22625,2011,11,1,13,red kitchen scales,2,2011-11-07 13:22:00,0.0,13014,United Kingdom,0.0
329006,574920,22899,2011,11,1,16,children's apron dolly girl,1,2011-11-07 16:34:00,0.0,13985,United Kingdom,0.0
329007,574920,23480,2011,11,1,16,mini lights woodland mushrooms,1,2011-11-07 16:34:00,0.0,13985,United Kingdom,0.0
334242,575579,22437,2011,11,4,11,set of 9 black skull balloons,20,2011-11-10 11:49:00,0.0,13081,United Kingdom,0.0
334243,575579,22089,2011,11,4,11,paper bunting vintage paisley,24,2011-11-10 11:49:00,0.0,13081,United Kingdom,0.0
352746,577129,22464,2011,11,4,19,hanging metal heart lantern,4,2011-11-17 19:52:00,0.0,15602,United Kingdom,0.0
353097,577168,M,2011,11,5,10,manual,1,2011-11-18 10:42:00,0.0,12603,Germany,0.0
354170,577314,23407,2011,11,5,13,set of 2 trays home sweet home,2,2011-11-18 13:23:00,0.0,12444,Norway,0.0
358629,577696,M,2011,11,1,11,manual,1,2011-11-21 11:57:00,0.0,16406,United Kingdom,0.0
370473,578841,84826,2011,11,5,15,asstd design 3d paper stickers,12540,2011-11-25 15:57:00,0.0,13256,United Kingdom,0.0

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [138]:
# your code here
df[df['Description'].str.find('lunch bag') != -1]

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
93,536378,20725,2010,12,3,9,lunch bag red retrospot,10,2010-12-01 09:37:00,1.65,14688,United Kingdom,16.50
172,536385,22662,2010,12,3,9,lunch bag dolly girl design,10,2010-12-01 09:56:00,1.65,17420,United Kingdom,16.50
354,536401,22662,2010,12,3,11,lunch bag dolly girl design,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
359,536401,20725,2010,12,3,11,lunch bag red retrospot,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
360,536401,22382,2010,12,3,11,lunch bag spaceboy design,2,2010-12-01 11:21:00,1.65,15862,United Kingdom,3.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...
397465,581486,23207,2011,12,5,9,lunch bag alphabet design,10,2011-12-09 09:38:00,1.65,17001,United Kingdom,16.50
397713,581538,20727,2011,12,5,11,lunch bag black skull.,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397714,581538,20725,2011,12,5,11,lunch bag red retrospot,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397877,581581,23681,2011,12,5,12,lunch bag red vintage doily,10,2011-12-09 12:20:00,1.65,17581,United Kingdom,16.50
397880,581583,20725,2011,12,5,12,lunch bag red retrospot,40,2011-12-09 12:23:00,1.45,13777,United Kingdom,58.00

#### Select all `lunch bag` orders made in 2011.

In [139]:
# your code here
df[(df['Description'].str.find('lunch bag') != -1) & (df['year'] == 2011)]

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
26340,540015,20725,2011,1,2,11,lunch bag red retrospot,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26341,540015,20726,2011,1,2,11,lunch bag woodland,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26512,540023,22382,2011,1,2,12,lunch bag spaceboy design,2,2011-01-04 12:58:00,1.65,15039,United Kingdom,3.30
26513,540023,20726,2011,1,2,12,lunch bag woodland,1,2011-01-04 12:58:00,1.65,15039,United Kingdom,1.65
26860,540098,22384,2011,1,2,15,lunch bag pink polkadot,1,2011-01-04 15:50:00,1.65,16241,United Kingdom,1.65
...,...,...,...,...,...,...,...,...,...,...,...,...,...
397465,581486,23207,2011,12,5,9,lunch bag alphabet design,10,2011-12-09 09:38:00,1.65,17001,United Kingdom,16.50
397713,581538,20727,2011,12,5,11,lunch bag black skull.,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397714,581538,20725,2011,12,5,11,lunch bag red retrospot,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397877,581581,23681,2011,12,5,12,lunch bag red vintage doily,10,2011-12-09 12:20:00,1.65,17581,United Kingdom,16.50
397880,581583,20725,2011,12,5,12,lunch bag red retrospot,40,2011-12-09 12:23:00,1.45,13777,United Kingdom,58.00

#### Show the frequency distribution of the amount spent in Spain.

In [140]:
# your code here
df[df['Country'] == 'Spain']['amount_spent'].value_counts(sort= False, bins= 3)

(-1.351, 450.0]    2477
(450.0, 900.0]        2
(900.0, 1350.0]       6
Name: amount_spent, dtype: int64

#### Select all orders made in the month of August.

In [141]:
# your code here
df[df['month'] == 8]

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
199475,561904,22075,2011,8,1,8,6 ribbons elegant christmas,96,2011-08-01 08:30:00,1.45,17941,United Kingdom,139.20
199476,561904,85049E,2011,8,1,8,scandinavian reds ribbons,156,2011-08-01 08:30:00,1.06,17941,United Kingdom,165.36
199477,561905,21385,2011,8,1,9,ivory hanging decoration heart,24,2011-08-01 09:31:00,0.85,14947,United Kingdom,20.40
199478,561905,84970L,2011,8,1,9,single heart zinc t-light holder,12,2011-08-01 09:31:00,0.95,14947,United Kingdom,11.40
199479,561905,84970S,2011,8,1,9,hanging heart zinc t-light holder,12,2011-08-01 09:31:00,0.85,14947,United Kingdom,10.20
...,...,...,...,...,...,...,...,...,...,...,...,...,...
226483,565067,22644,2011,8,3,17,ceramic cherry cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226484,565067,22645,2011,8,3,17,ceramic heart fairy cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226485,565067,22637,2011,8,3,17,piggy bank retrospot,2,2011-08-31 17:16:00,2.55,15856,United Kingdom,5.10
226486,565067,22646,2011,8,3,17,ceramic strawberry cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226487,565067,22741,2011,8,3,17,funky diva pen,48,2011-08-31 17:16:00,0.85,15856,United Kingdom,40.80

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [142]:
# your code here
df[df['month'] == 8].value_counts(subset= ['Country'])

Country
United Kingdom     23105
Germany              795
EIRE                 593
France               569
Netherlands          280
Switzerland          267
Spain                252
Belgium              194
Israel               171
Channel Islands      140
Australia            107
Italy                 95
Austria               88
Norway                77
Finland               61
Malta                 55
Portugal              41
Sweden                40
Unspecified           23
Iceland               22
Poland                17
Denmark               16
Canada                 5
dtype: int64

#### What's the  average amount of money spent by country?

In [143]:
# your code here
df.groupby(by= 'Country')['amount_spent'].agg('mean').round(decimals= 2)

Country
Australia               116.90
Austria                  25.62
Bahrain                  32.26
Belgium                  20.28
Brazil                   35.74
Canada                   24.28
Channel Islands          27.34
Cyprus                   22.13
Czech Republic           33.07
Denmark                  49.88
EIRE                     36.69
European Community       21.67
Finland                  32.91
France                   25.06
Germany                  25.31
Greece                   32.83
Iceland                  23.68
Israel                   29.12
Italy                    23.06
Japan                   116.56
Lebanon                  37.64
Lithuania                47.46
Malta                    24.34
Netherlands             120.80
Norway                   33.74
Poland                   22.23
Portugal                 22.87
RSA                      17.28
Saudi Arabia             16.21
Singapore                95.85
Spain                    24.78
Sweden                   85.10
Switzerland              30.64
USA                      20.00
United Arab Emirates     27.97
United Kingdom           20.63
Unspecified              10.93
Name: amount_spent, dtype: float64

#### What's the most expensive item?

In [144]:
# your code here
df[df['UnitPrice'] == df['UnitPrice'].max()]['Description']

118352    postage
Name: Description, dtype: object

#### What is the average amount spent per year?

In [145]:
# your code here
df.groupby(by= 'year')['amount_spent'].agg('mean').round(decimals= 2)

year
2010    21.89
2011    22.43
Name: amount_spent, dtype: float64